import 'package:flutter/foundation.dart';

class Question {
  final String title;
  final List<Map> answers;

  Question({
    required this.title,
    required this.answers,
  });
}

class QuestionData {
  final _data = [
    Question(
        title: '1. Чи користувались  ви послугами   Нової пошти?',
        answers: [
          {'answer' : 'Так, користувався/лась',},
          {'answer' : 'Ні, не користувався/лась',},
        ]
    ),
    Question(
        title: '2. Як давно ви користувались послугами Нової пошти?',
        answers: [
          {'answer' : 'Протягом минулого тижня',},
          {'answer' : '3-4 тижні назад',},
          {'answer' : '2-4 місяці назад',},
          {'answer' : 'Взагалі не користувався/лась',},
        ]
    ),
    Question(
        title: '3. Чи сподобались послуги компанії, якщо ви ними користувалися?',
        answers: [
          {'answer' : 'Так',},
          {'answer' : 'Ні',},
          {'answer' : 'Більше ні, аніж так',},
          {'answer' : 'Я взагалі не користувався/лась послугами цієї компанії',},
        ]
    ),
    Question(
        title: '4. Щоб ви хотіли змінити в роботі компанії?',
        answers: [
          {'answer' : 'Отримання посилки в поштоматі без МД',},
          {'answer' : 'Якість роботи ППВ',},
          {'answer' : 'Вартість доставки',},
          {'answer' : 'Збільшення кількості відділень',},
        ]
    ),
    Question(
        title: '5. Чи отримували/відправляли посилки через ППВ?',
        answers: [
          {'answer' : 'Так',},
          {'answer' : 'Ні',},
          {'answer' : 'Немає в моєму місті/селі',},
        ]
    ),
    Question(
        title: '6. Наскільки ви задоволені якістю обслуговування в ППВ?',
        answers: [
          {'answer' : 'Задоволена/ний',},
          {'answer' : 'Незадоволена/ний',},
          {'answer' : 'Не користуюсь послугами НП',},
        ]
    ),
    Question(
        title: '7. Чи було втрачено або пошкоджено вашу посилку/вантаж?',
        answers: [
          {'answer' : 'Так',},
          {'answer' : 'Ні',},
          {'answer' : 'Частково було пошкоджено',},
          {'answer' : 'Не користувався послугами НП',},
        ]
    ),
    Question(
        title: '8. Чи отримували компенсацію за втрачений/пошкоджений вантаж?',
        answers: [
          {'answer' : 'Так',},
          {'answer' : 'Ні',},
          {'answer' : 'Часткова компенсація від ОВ',},
          {'answer' : 'Ні, так як не користуюся послугами НП',},
        ]
    ),
    Question(
        title: '9. Наскільки швидко було компенсовано кошти щодо втраченого/пошкодженого вантажу після написання претензії?',
        answers: [
          {'answer' : 'Через 1-3 дні',},
          {'answer' : 'Більше, ніж через 3 дні',},
          {'answer' : 'Я не отримував/ла компенсацію коштів',},
          {'answer' : 'Я не користувався послугами НП',},
        ]
    ),
    Question(
        title: '10. Чи рекомендували б ви користуватися послугами Нової пошти для близьких/рідних?',
        answers: [
          {'answer' : 'Так',},
          {'answer' : 'Ні',},
          {'answer' : 'Можливо',},
        ]
    ),
  ];
  List<Question> get qestions => [..._data];
}